<?php

namespace Database\Seeders;

use App\Models\Section;
use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;

class SectionSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        Section::create([
            'title' => 'РОЗДІЛ 1. ЛІТЕРАТУРОЗНАВЧІ ЗАСАДИ МЕТОДИКИ НАВЧАННЯ ЧИТАННЯ В ПОЧАТКОВІЙ ШКОЛІ',
            'description' => 'Пояснювати сутність поняття “література” як виду мистецтва.
Визначати об’єкт зображення, предмет зображення і предмет пізнання в художніх творах.
Відрізняти і характеризувати ознаки художніх та інформаційних текстів.
Характеризувати сутність, особливості та функції дитячої літератури.
Визначати функції творів дитячої літератури.
Знати коло сучасних українських дитячих письменників та  літературної періодики для дітей, проводити критичний аналіз видань. 
Пояснювати діалектичну єдність змісту і форми. Наводити приклади.
Розробляти зміст евристичної бесіди для ознайомлення здобувачів початкової освіти з літературними поняттями, явищами, прикладами.
Правильно оперувати поняттями: зміст, форма, тема, ідея, конфлікт, проблематика, пафос, композиція, зображально-виражальні засоби в процесі пообразного, проблемного, цілісного аналізів літературного тексту.
 Презентувати результати власної дослідницької діяльності у формі есе, доповіді, тез, термінологічного словника, бібліографії з теми, презентації, участі в дискусії тощо.
Оформлювати результати власної літературної творчості, добираючи ефективні форми презентації.
 Визначати змістові компоненти та сюжетно-композиційну будову художнього твору.
 Визначати та характеризувати віршовий розмір, порівнювати художні засоби різних груп віршованого і прозового мовлення у творах.
  Характеризувати родово-жанрові типологічні ознаки творів художньої літератури, зокрема в підручниках-читанках.
 Проводити всі види літературознавчого аналізу, ілюструючи дотримання системи принципів.
 Порівнювати зміст і обсяг літературознавчої пропедевтики в підручниках з української мови (літературного читання) за різними типовими освітніми програмами.
 Характеризувати методичну основу пропедевтичного підходу вивчення основних літературознавчих понять у початковій школі.
 Формулювати визначення літературознавчих понять для учнів початкових класів.
 Обирати та обґрунтовувати доцільний метод (прийоми) для вивчення здобувачами початкової освіти літературознавчих понять.
 Обирати та ефективно використовувати цифрові сервіси для проєктування та розроблення цифрового супроводу для презентації результатів власної методичної та літературної діяльності.
',
            'order' => 1,
        ]);

        Section::create([
            'title' => 'РОЗДІЛ 2. ПСИХОЛОГО-ПЕДАГОГІЧНІ ЗАСАДИ НАВЧАННЯ ЧИТАННЯ МОЛОДШИХ ШКОЛЯРІВ',
            'description' => 'Опис для розділу 2',
            'order' => 2,
        ]);

        Section::create([
            'title' => 'РОЗДІЛ 3. МЕТОДИКА РОБОТИ НАД ТЕКСТОМ ХУДОЖНЬОГО ТВОРУ В 1-4 КЛАСАХ',
            'description' => 'Опис для розділу 3',
            'order' => 3,
        ]);
    }
}
