<?php

namespace Database\Seeders;

use App\Models\Figure;
use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;

class TestFigureSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        Figure::create([
            'name' => 'Тарас Шевченко',
            'biography' => 'Український поет, письменник, художник, громадський діяч. Народився 1814 року в селі Моринці на Черкащині. Автор «Кобзаря» та багатьох інших літературних творів.'
        ]);

        Figure::create([
            'name' => 'Іван Франко',
            'biography' => 'Український письменник, поет, публіцист, перекладач, науковець, громадський діяч. Один із найвидатніших діячів української культури кінця XIX — початку XX століття.'
        ]);

        Figure::create([
            'name' => 'Леся Українка',
            'biography' => 'Українська письменниця, поетеса, драматург, публіцист, перекладач, культурний діяч. Справжнє ім\'я — Лариса Петрівна Косач.'
        ]);

        Figure::create([
            'name' => 'Микола Гоголь',
            'biography' => 'Російський письменник українського походження, драматург, критик, публіцист. Класик російської літератури.'
        ]);

        Figure::create([
            'name' => 'Іван Котляревський',
            'biography' => 'Український письменник, драматург, громадський діяч. Засновник нової української літератури, автор «Енеїди».'
        ]);
    }
} 